export interface Category {
    name: string;
    sub: string[];
}

export const categories: Category[] = [
    {
        name: '상의',
        sub: ['전체', '맨투맨/스웨트', '후드 티셔츠', '셔츠/블라우스', '긴소매 티셔츠', '반소매 티셔츠', '니트/스웨터', '기타상의'],
    },
    { name: '신발', sub: ['전체', '스니커즈', '부츠/워커', '구두', '샌들/슬리퍼'] },
    {
        name: '아우터',
        sub: [
            '전체',
            '후드집업',
            '블루종/MA-1',
            '레더/라이더스',
            '카디건',
            '트러커',
            '슈트/블레이저',
            '트레이닝',
            '코트',
            '패딩',
            '기타 아우터',
        ],
    },
    {
        name: '바지',
        sub: ['전체', '데님팬츠', '트레이닝/조거 팬츠', '코튼팬츠', '슈트 팬츠/슬랙스', '숏팬츠', '레깅스', '기타하의'],
    },
    {
        name: '가방',
        sub: ['전체', '메신저/크로스 백', '숄더백', '백팩', '토트백', '에코백', '파우치', '캐리어', '클러치백'],
    },
    {
        name: '패션소품',
        sub: ['전체', '모자', '머플러', '주얼리', '양말', '선글라스', '액세서리', '시계', '벨트'],
    },
];
